In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

In [3]:
gdp_df = pd.read_csv("../data/gdp_percapita.csv")

In [4]:
internet_df = pd.read_csv("../data/internet_use.csv", nrows=4496)

In [5]:
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN

In [6]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [7]:
gdp_df.head(10)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN
6     Afghanistan  2013  2116.465454              NaN
7     Afghanistan  2012  2075.491747              NaN
8     Afghanistan  2011  1904.559799              NaN
9     Afghanistan  2010  1957.029338              NaN

In [8]:
internet_df.head(10)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN
6     Afghanistan  2008  1.840000              NaN
7     Afghanistan  2007  1.900000              NaN
8     Afghanistan  2006  2.107124              NaN
9     Afghanistan  2005  1.224148              NaN

In [9]:
df.drop(['Value Footnotes'])

NameError: name 'df' is not defined

In [ ]:
gdp_df = gdp_df.drop(columns=['Value Footnotes'])

In [ ]:
gdp_df = gdp_df.drop(columns=['Value Footnotes'])

In [10]:
gdp_df = gdp_df.drop(columns=['Value Footnotes'])

In [11]:
gdp_df = gdp_df.drop(columns=['Country or Area': 'Country', 'Year': 'Year', 'Value': 'GDP_Per_Capita'])

SyntaxError: invalid syntax (2166670014.py, line 1)

In [12]:
gdp_df = gdp_df.rename(columns=['Country or Area': 'Country', 'Year': 'Year', 'Value': 'GDP_Per_Capita'])

SyntaxError: invalid syntax (2336758180.py, line 1)

In [13]:
gdp_df = gdp_df.rename(columns={'Country or Area': 'Country', 'Year': 'Year', 'Value': 'GDP_Per_Capita'})

In [14]:
internet_df = internet_df.rename(columns={'Country or Area': 'Country', 'Year': 'Year', 'Value': 'Internet_Users_Pct'})